app/Controllers/BaseController.php

SELECT *
FROM `currencies`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `active` = 1
ORDER BY `code` ASC
---
    protected function companyCurrencyOptions(?string $companyId = null, ?string $selectedCode = null): array
    {
        if (! $companyId) {
            return $this->globalCurrencyCatalogOptions($selectedCode);
        }

        $currencyModel = new CurrencyModel();
        $options = [];
        $companyCurrencies = $currencyModel
            ->where('company_id', $companyId)
            ->where('active', 1)
            ->orderBy('code', 'ASC')
            ->findAll();