app/Controllers/SalesController.php

    public function configuration()
    {
        $context = $this->salesContext('manage');

        if ($context instanceof RedirectResponse) {
            return $context;
        }

        $settings = $this->salesSettings($context['company']['id']);
        $arcaService = new ArcaService();

        return view('sales/configuration', [
            'pageTitle' => 'Configuracion de Ventas',
            'context' => $context,
            'companies' => $this->salesCompanies(),
            'selectedCompanyId' => $context['company']['id'],
            'settings' => $settings,
            'currencies' => (new \App\Models\CurrencyModel())->where('company_id', $context['company']['id'])->where('active', 1)->orderBy('code', 'ASC')->findAll(),
            'arcaServices' => $arcaService->statusSummary($settings),
            'arcaReadiness' => $arcaService->readiness($settings),
            'arcaDiagnostics' => $arcaService->certificateDiagnostics($settings),
            'arcaEnvironments' => $arcaService->environmentDiagnostics($settings),
            'arcaEvents' => $this->arcaEventRows($context['company']['id']),
            'documentTypes' => $this->documentTypeOptions($context['company']['id']),
            'pointsOfSale' => $this->pointOfSaleOptions($context['company']['id']),
            'receivableSummary' => $this->receivableSummary($context['company']['id']),
            'deviceSettings' => (new PosDeviceSettingModel())->where('company_id', $context['company']['id'])->orderBy('channel', 'ASC')->orderBy('device_type', 'ASC')->findAll(),
            'hardwareLogs' => (new HardwareLogModel())->where('company_id', $context['company']['id'])->orderBy('created_at', 'DESC')->findAll(20),
---
SELECT *
FROM `currencies`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `active` = 1
ORDER BY `code` ASC
SELECT *
FROM `pos_device_settings`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
ORDER BY `channel` ASC, `device_type` ASC
SELECT *
FROM `hardware_logs`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
ORDER BY `created_at` DESC
 LIMIT 20

    private function salesContext(string $requiredAccess = 'view')
    {
        $companyId = $this->resolveSalesCompanyId();
        if (! $companyId) {
            return redirect()->to('/sistemas')->with('error', 'Debes seleccionar una empresa para operar Ventas.');
        }

        $company = (new CompanyModel())->find($companyId);
        if (! $company) {
            return redirect()->to('/sistemas')->with('error', 'La empresa seleccionada no existe.');
        }

        $system = (new SystemModel())->where('slug', 'ventas')->first();
        if (! $system || (int) ($system['active'] ?? 0) !== 1) {
            return redirect()->to('/sistemas')->with('error', 'El sistema Ventas no esta disponible.');
        }

        $accessLevel = 'view';
        $companyAssignment = (new CompanySystemModel())
            ->where('company_id', $companyId)
            ->where('system_id', $system['id'])
            ->where('active', 1)
            ->first();

        if (! $this->isSuperadmin()) {
            if (! $companyAssignment) {
                return redirect()->to('/sistemas')->with('error', 'La empresa no tiene Ventas asignado.');
            }

            $userAssignment = (new UserSystemModel())
                ->where('company_id', $companyId)
                ->where('user_id', $this->currentUser()['id'] ?? '')
                ->where('system_id', $system['id'])
                ->where('active', 1)
                ->first();
---
SELECT *
FROM `companies`
WHERE `companies`.`id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
SELECT *
FROM `systems`
WHERE `slug` = 'ventas'
 LIMIT 1
SELECT *
FROM `company_systems`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `system_id` = '79afdce5-3e18-4f78-958f-693bb130b6a7'
AND `active` = 1
 LIMIT 1
SELECT *
FROM `user_systems`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `user_id` = 'd2f12d2a-75bd-46f8-89d5-fbb35bf990fe'
AND `system_id` = '79afdce5-3e18-4f78-958f-693bb130b6a7'
AND `active` = 1
 LIMIT 1

    private function ensureSalesDefaults(string $companyId): void
    {
        $branch = (new BranchModel())->where('company_id', $companyId)->where('code', 'MAIN')->first();
        $sequenceModel = new VoucherSequenceModel();

        foreach ([['document_type' => 'VENTA', 'prefix' => 'VTA'], ['document_type' => 'FACTURA', 'prefix' => 'FAC'], ['document_type' => 'TICKET', 'prefix' => 'TCK'], ['document_type' => 'NC', 'prefix' => 'NC'], ['document_type' => 'RECIBO', 'prefix' => 'REC']] as $row) {
            if (! $sequenceModel->where('company_id', $companyId)->where('document_type', $row['document_type'])->first()) {
                $sequenceModel->insert([
                    'company_id' => $companyId,
                    'branch_id' => $branch['id'] ?? null,
                    'document_type' => $row['document_type'],
                    'prefix' => $row['prefix'],
                    'current_number' => 1,
                    'active' => 1,
                ]);
            }
        }

        $customerModel = new CustomerModel();
        if (! $customerModel->where('company_id', $companyId)->where('name', 'Consumidor Final')->first()) {
---
SELECT *
FROM `branches`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `code` = 'MAIN'
 LIMIT 1
SELECT *
FROM `voucher_sequences`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `document_type` = 'VENTA'
 LIMIT 1
SELECT *
FROM `customers`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `name` = 'Consumidor Final'
 LIMIT 1

        }

        $priceListModel = new SalesPriceListModel();
        if (! $priceListModel->where('company_id', $companyId)->where('is_default', 1)->first()) {
---
SELECT *
FROM `sales_price_lists`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `is_default` = 1
 LIMIT 1

    private function ensureSalesDocumentDefaults(string $companyId, ?string $branchId): void
    {
        $documentTypeModel = new SalesDocumentTypeModel();
        $pointOfSaleModel = new SalesPointOfSaleModel();
        $defaultWarehouse = (new InventoryWarehouseModel())->where('company_id', $companyId)->where('active', 1)->orderBy('is_default', 'DESC')->orderBy('name', 'ASC')->first();

        $definitions = [
            ['code' => 'PRESUPUESTO', 'name' => 'Presupuesto', 'category' => 'quote', 'letter' => null, 'sequence_key' => 'PRESUPUESTO', 'default_prefix' => 'PRE', 'channel' => 'standard', 'impacts_stock' => 0, 'impacts_receivable' => 0, 'requires_customer' => 0, 'sort_order' => 1],
            ['code' => 'PEDIDO', 'name' => 'Pedido', 'category' => 'order', 'letter' => null, 'sequence_key' => 'PEDIDO', 'default_prefix' => 'PED', 'channel' => 'standard', 'impacts_stock' => 0, 'impacts_receivable' => 0, 'requires_customer' => 1, 'sort_order' => 2],
            ['code' => 'REMITO', 'name' => 'Remito', 'category' => 'delivery_note', 'letter' => null, 'sequence_key' => 'REMITO', 'default_prefix' => 'RTO', 'channel' => 'standard', 'impacts_stock' => 1, 'impacts_receivable' => 0, 'requires_customer' => 1, 'sort_order' => 3],
            ['code' => 'FACTURA_A', 'name' => 'Factura A', 'category' => 'invoice', 'letter' => 'A', 'sequence_key' => 'FACTURA_A', 'default_prefix' => 'FCA', 'channel' => 'standard', 'impacts_stock' => 1, 'impacts_receivable' => 1, 'requires_customer' => 1, 'sort_order' => 4],
            ['code' => 'FACTURA_B', 'name' => 'Factura B', 'category' => 'invoice', 'letter' => 'B', 'sequence_key' => 'FACTURA_B', 'default_prefix' => 'FCB', 'channel' => 'standard', 'impacts_stock' => 1, 'impacts_receivable' => 1, 'requires_customer' => 0, 'sort_order' => 5],
            ['code' => 'FACTURA_C', 'name' => 'Factura C', 'category' => 'invoice', 'letter' => 'C', 'sequence_key' => 'FACTURA_C', 'default_prefix' => 'FCC', 'channel' => 'standard', 'impacts_stock' => 1, 'impacts_receivable' => 1, 'requires_customer' => 0, 'sort_order' => 6],
            ['code' => 'FACTURA_M', 'name' => 'Factura M', 'category' => 'invoice', 'letter' => 'M', 'sequence_key' => 'FACTURA_M', 'default_prefix' => 'FCM', 'channel' => 'standard', 'impacts_stock' => 1, 'impacts_receivable' => 1, 'requires_customer' => 1, 'sort_order' => 7],
            ['code' => 'TICKET', 'name' => 'Ticket Consumidor Final', 'category' => 'ticket', 'letter' => null, 'sequence_key' => 'TICKET', 'default_prefix' => 'TCK', 'channel' => 'kiosk', 'impacts_stock' => 1, 'impacts_receivable' => 0, 'requires_customer' => 0, 'sort_order' => 8],
            ['code' => 'NC_A', 'name' => 'Nota de Credito A', 'category' => 'credit_note', 'letter' => 'A', 'sequence_key' => 'NC_A', 'default_prefix' => 'NCA', 'channel' => 'standard', 'impacts_stock' => 0, 'impacts_receivable' => 1, 'requires_customer' => 1, 'sort_order' => 9],
            ['code' => 'NC_B', 'name' => 'Nota de Credito B', 'category' => 'credit_note', 'letter' => 'B', 'sequence_key' => 'NC_B', 'default_prefix' => 'NCB', 'channel' => 'standard', 'impacts_stock' => 0, 'impacts_receivable' => 1, 'requires_customer' => 1, 'sort_order' => 10],
            ['code' => 'NC_C', 'name' => 'Nota de Credito C', 'category' => 'credit_note', 'letter' => 'C', 'sequence_key' => 'NC_C', 'default_prefix' => 'NCC', 'channel' => 'standard', 'impacts_stock' => 0, 'impacts_receivable' => 1, 'requires_customer' => 1, 'sort_order' => 11],
            ['code' => 'ND_A', 'name' => 'Nota de Debito A', 'category' => 'debit_note', 'letter' => 'A', 'sequence_key' => 'ND_A', 'default_prefix' => 'NDA', 'channel' => 'standard', 'impacts_stock' => 0, 'impacts_receivable' => 1, 'requires_customer' => 1, 'sort_order' => 12],
            ['code' => 'ND_B', 'name' => 'Nota de Debito B', 'category' => 'debit_note', 'letter' => 'B', 'sequence_key' => 'ND_B', 'default_prefix' => 'NDB', 'channel' => 'standard', 'impacts_stock' => 0, 'impacts_receivable' => 1, 'requires_customer' => 1, 'sort_order' => 13],
            ['code' => 'ND_C', 'name' => 'Nota de Debito C', 'category' => 'debit_note', 'letter' => 'C', 'sequence_key' => 'ND_C', 'default_prefix' => 'NDC', 'channel' => 'standard', 'impacts_stock' => 0, 'impacts_receivable' => 1, 'requires_customer' => 1, 'sort_order' => 14],
        ];

        $documentTypeIds = [];
        foreach ($definitions as $definition) {
            $existing = $documentTypeModel->where('company_id', $companyId)->where('code', $definition['code'])->first();
---
SELECT *
FROM `sales_document_types`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `code` = 'PRESUPUESTO'
 LIMIT 1

    private function salesRows(string $companyId, array $filters): array
    {
        $builder = db_connect()->table('sales s')
            ->select('s.*, c.name AS customer_name, dt.name AS document_type_name, dt.code AS document_type_code, dt.category AS document_category, pos.name AS point_of_sale_name, w.name AS warehouse_name, u.name AS created_by_name, src.sale_number AS source_sale_number, src.document_code AS source_document_code, srcdt.name AS source_document_name')
            ->join('customers c', 'c.id = s.customer_id', 'left')
            ->join('sales_document_types dt', 'dt.id = s.document_type_id', 'left')
            ->join('sales_points_of_sale pos', 'pos.id = s.point_of_sale_id', 'left')
            ->join('inventory_warehouses w', 'w.id = s.warehouse_id', 'left')
            ->join('users u', 'u.id = s.created_by', 'left')
            ->join('sales src', 'src.id = s.source_sale_id', 'left')
            ->join('sales_document_types srcdt', 'srcdt.id = src.document_type_id', 'left')
            ->where('s.company_id', $companyId)
            ->orderBy('s.issue_date', 'DESC');

        if (! empty($filters['status'])) {
            $builder->where('s.status', $filters['status']);
        }
        if (! empty($filters['customer_id'])) {
            $builder->where('s.customer_id', $filters['customer_id']);
        }
        if (! empty($filters['date_from'])) {
            $builder->where('s.issue_date >=', $filters['date_from'] . ' 00:00:00');
        }
        if (! empty($filters['date_to'])) {
            $builder->where('s.issue_date <=', $filters['date_to'] . ' 23:59:59');
        }

        return $builder
            ->join('sales_agents sa', 'sa.id = s.sales_agent_id', 'left')
            ->join('sales_zones sz', 'sz.id = s.sales_zone_id', 'left')
            ->join('sales_conditions sc', 'sc.id = s.sales_condition_id', 'left')
            ->select('sa.name AS sales_agent_name, sz.name AS sales_zone_name, sc.name AS sales_condition_name')
            ->get()
            ->getResultArray();
---
SELECT `s`.*, `c`.`name` AS `customer_name`, `dt`.`name` AS `document_type_name`, `dt`.`code` AS `document_type_code`, `dt`.`category` AS `document_category`, `pos`.`name` AS `point_of_sale_name`, `w`.`name` AS `warehouse_name`, `u`.`name` AS `created_by_name`, `src`.`sale_number` AS `source_sale_number`, `src`.`document_code` AS `source_document_code`, `srcdt`.`name` AS `source_document_name`, `sa`.`name` AS `sales_agent_name`, `sz`.`name` AS `sales_zone_name`, `sc`.`name` AS `sales_condition_name`
FROM `sales` `s`
LEFT JOIN `customers` `c` ON `c`.`id` = `s`.`customer_id`
LEFT JOIN `sales_document_types` `dt` ON `dt`.`id` = `s`.`document_type_id`
LEFT JOIN `sales_points_of_sale` `pos` ON `pos`.`id` = `s`.`point_of_sale_id`
LEFT JOIN `inventory_warehouses` `w` ON `w`.`id` = `s`.`warehouse_id`
LEFT JOIN `users` `u` ON `u`.`id` = `s`.`created_by`
LEFT JOIN `sales` `src` ON `src`.`id` = `s`.`source_sale_id`
LEFT JOIN `sales_document_types` `srcdt` ON `srcdt`.`id` = `src`.`document_type_id`
LEFT JOIN `sales_agents` `sa` ON `sa`.`id` = `s`.`sales_agent_id`
LEFT JOIN `sales_zones` `sz` ON `sz`.`id` = `s`.`sales_zone_id`
LEFT JOIN `sales_conditions` `sc` ON `sc`.`id` = `s`.`sales_condition_id`
WHERE `s`.`company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
ORDER BY `s`.`issue_date` DESC

    private function receivableSummary(string $companyId): array
    {
        $row = db_connect()->table('sales_receivables')
            ->select('COUNT(id) AS pending, COALESCE(SUM(balance_amount), 0) AS balance', false)
            ->where('company_id', $companyId)
            ->whereIn('status', ['pending', 'partial'])
            ->get()
            ->getRowArray();
---
SELECT COUNT(id) AS pending, COALESCE(SUM(balance_amount), 0) AS balance
FROM `sales_receivables`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `status` IN ('pending','partial')

    private function customerOptions(string $companyId): array
    {
        return (new CustomerModel())->where('company_id', $companyId)->where('active', 1)->orderBy('name', 'ASC')->findAll();
---
SELECT *
FROM `customers`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `active` = 1
ORDER BY `name` ASC

    private function priceListOptions(string $companyId): array
    {
        return (new SalesPriceListModel())->where('company_id', $companyId)->where('active', 1)->orderBy('is_default', 'DESC')->orderBy('name', 'ASC')->findAll();
---
SELECT *
FROM `sales_price_lists`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `active` = 1
ORDER BY `is_default` DESC, `name` ASC

    private function activePromotions(string $companyId): array
    {
        $now = date('Y-m-d H:i:s');
        return (new SalesPromotionModel())
            ->where('company_id', $companyId)
            ->where('active', 1)
            ->groupStart()->where('start_date IS NULL')->orWhere('start_date <=', $now)->groupEnd()
            ->groupStart()->where('end_date IS NULL')->orWhere('end_date >=', $now)->groupEnd()
            ->orderBy('name', 'ASC')
            ->findAll();
---
SELECT *
FROM `sales_promotions`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `active` = 1
AND   (
`start_date` IS NULL
OR `start_date` <= '2026-04-20 14:32:36'
 )
AND   (
`end_date` IS NULL
OR `end_date` >= '2026-04-20 14:32:36'
 )
ORDER BY `name` ASC

    private function saleItems(string $saleId): array
    {
        return (new SaleItemModel())->where('sale_id', $saleId)->orderBy('line_number', 'ASC')->findAll();
---
SELECT *
FROM `sale_items`
WHERE `sale_id` = '93f039d6-82c6-47b9-9e24-d675d479a620'
ORDER BY `line_number` ASC

    private function ownedSale(string $companyId, string $saleId): ?array
    {
        $row = (new SaleModel())->where('company_id', $companyId)->where('id', $saleId)->first();
---
SELECT *
FROM `sales`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `id` = '93f039d6-82c6-47b9-9e24-d675d479a620'
 LIMIT 1

    private function salesSettings(string $companyId): array
    {
        $model = new SalesSettingModel();
        $settings = $model->where('company_id', $companyId)->first();
---
SELECT *
FROM `sales_settings`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
 LIMIT 1

    private function arcaEventRows(string $companyId, int $limit = 10): array
    {
        return db_connect()->table('sales_arca_events sae')
            ->select('sae.*, s.sale_number, dt.name AS document_type_name, u.name AS performed_by_name')
            ->join('sales s', 's.id = sae.sale_id', 'left')
            ->join('sales_document_types dt', 'dt.id = s.document_type_id', 'left')
            ->join('users u', 'u.id = sae.performed_by', 'left')
            ->where('sae.company_id', $companyId)
            ->orderBy('sae.performed_at', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();
---
SELECT `sae`.*, `s`.`sale_number`, `dt`.`name` AS `document_type_name`, `u`.`name` AS `performed_by_name`
FROM `sales_arca_events` `sae`
LEFT JOIN `sales` `s` ON `s`.`id` = `sae`.`sale_id`
LEFT JOIN `sales_document_types` `dt` ON `dt`.`id` = `s`.`document_type_id`
LEFT JOIN `users` `u` ON `u`.`id` = `sae`.`performed_by`
WHERE `sae`.`company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
ORDER BY `sae`.`performed_at` DESC
 LIMIT 10

    private function authorizeSaleInArca(string $companyId, array $sale): array
    {
        $documentType = ! empty($sale['document_type_id']) ? (new SalesDocumentTypeModel())->find($sale['document_type_id']) : null;
        $pointOfSale = ! empty($sale['point_of_sale_id']) ? (new SalesPointOfSaleModel())->find($sale['point_of_sale_id']) : [];
        $company = (new CompanyModel())->find($companyId) ?? [];
---
SELECT *
FROM `sales_document_types`
WHERE `sales_document_types`.`id` = '34cc7759-ff30-47bd-b8a7-1faf47a88d8a'
SELECT *
FROM `companies`
WHERE `companies`.`id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'