app/Controllers/SettingsController.php

    public function index()
    {
        $companyId = $this->resolveCompanyId();
        $companyModel = new CompanyModel();

        if (! $companyId && $this->isSuperadmin()) {
            $firstCompany = $companyModel->orderBy('name', 'ASC')->first();
            $companyId = $firstCompany['id'] ?? null;
        }

        if (! $companyId) {
            return redirect()->to('/dashboard')->with('error', 'No tienes una empresa asignada para configurar.');
        }

        $branchModel = new BranchModel();
        $branchModel->ensureMainBranch($companyId);
        $currencyModel = new CurrencyModel();
        $taxModel = new TaxModel();
        $voucherModel = new VoucherSequenceModel();

        return view('settings/index', [
            'pageTitle' => 'Configuracion',
            'company' => $companyModel->find($companyId),
            'companies' => $this->isSuperadmin() ? $companyModel->orderBy('name', 'ASC')->findAll() : [],
            'branches' => $branchModel->where('company_id', $companyId)->orderBy('name', 'ASC')->findAll(),
            'currencies' => $currencyModel->where('company_id', $companyId)->orderBy('code', 'ASC')->findAll(),
            'taxes' => $taxModel->where('company_id', $companyId)->orderBy('name', 'ASC')->findAll(),
            'voucherSequences' => $voucherModel->where('company_id', $companyId)->orderBy('document_type', 'ASC')->findAll(),
---
SELECT *
FROM `companies`
WHERE `companies`.`id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
SELECT *
FROM `branches`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
ORDER BY `name` ASC
SELECT *
FROM `currencies`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
ORDER BY `code` ASC
SELECT *
FROM `taxes`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
ORDER BY `name` ASC
SELECT *
FROM `voucher_sequences`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
ORDER BY `document_type` ASC