app/Controllers/SystemsController.php

    public function index()
    {
        $companyModel = new CompanyModel();
        $selectedCompanyId = $this->resolveSystemsCompanyId();
        $selectedCompany = $selectedCompanyId ? $companyModel->find($selectedCompanyId) : null;
---
SELECT *
FROM `companies`
WHERE `companies`.`id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'

    private function catalogSystems(): array
    {
        return (new SystemModel())->orderBy('name', 'ASC')->findAll();
---
SELECT *
FROM `systems`
ORDER BY `name` ASC

    private function accessibleSystems(?string $companyId): array
    {
        if ($this->isSuperadmin()) {
            if (! $companyId) {
                return [];
            }

            $rows = (new SystemModel())
                ->select('systems.*')
                ->join('company_systems', 'company_systems.system_id = systems.id')
                ->where('company_systems.company_id', $companyId)
                ->where('company_systems.active', 1)
                ->where('systems.active', 1)
                ->orderBy('systems.name', 'ASC')
                ->findAll();

            return array_map(fn(array $system): array => [
                'id' => $system['id'],
                'name' => $system['name'],
                'slug' => $system['slug'],
                'description' => $system['description'],
                'entry_url' => $this->systemEntryUrl($system['entry_url']),
                'icon' => $system['icon'] ?: 'bi-grid',
                'access_level' => 'manage',
                'active' => 1,
            ], $rows);
        }

        $rows = (new UserSystemModel())
            ->select('systems.id, systems.name, systems.slug, systems.description, systems.entry_url, systems.icon, user_systems.access_level')
            ->join('systems', 'systems.id = user_systems.system_id')
            ->join('company_systems', 'company_systems.system_id = systems.id AND company_systems.company_id = user_systems.company_id')
            ->where('user_systems.user_id', $this->currentUser()['id'] ?? '')
            ->where('user_systems.company_id', $companyId)
            ->where('user_systems.active', 1)
            ->where('company_systems.active', 1)
            ->where('systems.active', 1)
            ->orderBy('systems.name', 'ASC')
            ->findAll();
---
SELECT `systems`.`id`, `systems`.`name`, `systems`.`slug`, `systems`.`description`, `systems`.`entry_url`, `systems`.`icon`, `user_systems`.`access_level`
FROM `user_systems`
JOIN `systems` ON `systems`.`id` = `user_systems`.`system_id`
JOIN `company_systems` ON `company_systems`.`system_id` = `systems`.`id` AND `company_systems`.`company_id` = `user_systems`.`company_id`
WHERE `user_systems`.`user_id` = 'd2f12d2a-75bd-46f8-89d5-fbb35bf990fe'
AND `user_systems`.`company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `user_systems`.`active` = 1
AND `company_systems`.`active` = 1
AND `systems`.`active` = 1
ORDER BY `systems`.`name` ASC

    private function companyAssignments(string $companyId): array
    {
        return (new CompanySystemModel())
            ->select('company_systems.*, systems.name AS system_name, systems.slug AS system_slug, systems.entry_url, systems.icon, systems.description')
            ->join('systems', 'systems.id = company_systems.system_id')
            ->where('company_systems.company_id', $companyId)
            ->orderBy('systems.name', 'ASC')
            ->findAll();
---
SELECT `company_systems`.*, `systems`.`name` AS `system_name`, `systems`.`slug` AS `system_slug`, `systems`.`entry_url`, `systems`.`icon`, `systems`.`description`
FROM `company_systems`
JOIN `systems` ON `systems`.`id` = `company_systems`.`system_id`
WHERE `company_systems`.`company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
ORDER BY `systems`.`name` ASC

    private function operatorAssignments(string $companyId): array
    {
        $rows = (new UserModel())
            ->select('users.id AS user_id, users.name AS user_name, users.username, roles.slug AS role_slug, user_systems.id, user_systems.access_level, user_systems.active, systems.name AS system_name, systems.slug AS system_slug')
            ->join('roles', 'roles.id = users.role_id')
            ->join('user_systems', 'user_systems.user_id = users.id AND user_systems.company_id = users.company_id', 'left')
            ->join('systems', 'systems.id = user_systems.system_id', 'left')
            ->where('users.company_id', $companyId)
            ->whereIn('roles.slug', ['admin', 'operador', 'vendedor'])
            ->orderBy('users.name', 'ASC')
            ->orderBy('systems.name', 'ASC', false)
            ->findAll();
---
SELECT `users`.`id` AS `user_id`, `users`.`name` AS `user_name`, `users`.`username`, `roles`.`slug` AS `role_slug`, `user_systems`.`id`, `user_systems`.`access_level`, `user_systems`.`active`, `systems`.`name` AS `system_name`, `systems`.`slug` AS `system_slug`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
LEFT JOIN `user_systems` ON `user_systems`.`user_id` = `users`.`id` AND `user_systems`.`company_id` = `users`.`company_id`
LEFT JOIN `systems` ON `systems`.`id` = `user_systems`.`system_id`
WHERE `users`.`company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
AND `roles`.`slug` IN ('admin','operador')
ORDER BY `users`.`name` ASC, systems.name ASC