app/Controllers/UsersController.php

    public function index()
    {
        $model = new UserModel();
        $builder = $model
            ->select('users.*, companies.name AS company_name, branches.name AS branch_name, roles.name AS role_name, roles.slug AS role_slug')
            ->join('companies', 'companies.id = users.company_id', 'left')
            ->join('branches', 'branches.id = users.branch_id', 'left')
            ->join('roles', 'roles.id = users.role_id', 'left')
            ->orderBy('users.name', 'ASC');

        if (! $this->isSuperadmin()) {
            $builder->where('users.company_id', $this->companyId());
        }

        return view('users/index', [
            'pageTitle' => 'Usuarios',
            'users' => $builder->findAll(),
---
SELECT `users`.*, `companies`.`name` AS `company_name`, `branches`.`name` AS `branch_name`, `roles`.`name` AS `role_name`, `roles`.`slug` AS `role_slug`
FROM `users`
LEFT JOIN `companies` ON `companies`.`id` = `users`.`company_id`
LEFT JOIN `branches` ON `branches`.`id` = `users`.`branch_id`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
ORDER BY `users`.`name` ASC