app/Models/BranchModel.php

SELECT COUNT(*) AS `numrows`
FROM `branches`
WHERE `company_id` = '1bc2ec3d-8fb1-487a-920f-40ea04e7e5ab'
---
    public function ensureMainBranch(string $companyId): void
    {
        $existing = $this->where('company_id', $companyId)->countAllResults();